Revit 2027 API
MEPNetworkSegmentData Constructor
 Creates a default segment data object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentData()
Public Sub New
public:
MEPNetworkSegmentData()
new : unit -> MEPNetworkSegmentData
See Also
Reference
MEPNetworkSegmentData Class
MEPNetworkSegmentData Overload
Autodesk.Revit.DB.Analysis Namespace